src/OneSBuild/src/InformationRegisters/ОчередьРасширенийДляОповещений/ОчередьРасширенийДляОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьРасширенийДляОповещений</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРасширений</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторРасширения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/OneSBuild/src/InformationRegisters/ОчередьРасширенийДляОповещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьОповещение(Знач ИдентификаторРасширения, Знач Пользователь, Знач Состояние) Экспорт
	
	Если ТипЗнч(ИдентификаторРасширения) <> Тип("УникальныйИдентификатор") Тогда
		ИдентификаторРасширения = Новый УникальныйИдентификатор(ИдентификаторРасширения);
	КонецЕсли;
	
	НоваяЗапись = РегистрыСведений.ОчередьРасширенийДляОповещений.СоздатьМенеджерЗаписи();
	НоваяЗапись.ИдентификаторРасширения = ИдентификаторРасширения;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.Состояние = Состояние;
	
	УстановитьПривилегированныйРежим(Истина);
	НоваяЗапись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
